# Triangle
Этот репозиторий представляет собой вилку основоного репозитория моей команды _"nerep"_, здесь представлены решения задач, которые выполнила моя команда
# Решени моей задачи
Я выбрал задачу про треугольник - необходимо написать программу на ЯП С++, которая сможет вычислить периметр треугольника, вычислить его площадь с помощью формулы Герона, а также проверить, является ли треугольник равнобедренным.
В формуле Герона используется функция квадратного корня, в ЯП С++ она реализована в стандартной библиотеке _cmath_.
Также я использовал библиотеку _locale_, чтобы кириллица корректно выводилась:
```
#include <iostream>
#include <locale.h>
...
setlocale(LC_ALL, "Rus");
```
При решении моей задачи я разбил код на блоки, каждый из которых решает определнную задачу (процедурная декомпозиция):
1. Вычисление периметра теругольника
```
// вычисление периметра
perimeter = a + b + c;
cout << "\nПериметр треугольника равен " << perimeter << "\n";
```
2. Вычисление площади треугольника по формуле Герона
```
// вычисление площади
half_perimeter = perimeter / 2;
area = sqrt(half_perimeter * (half_perimeter - a) * (half_perimeter - b) * (half_perimeter - c));
cout << "\nПлощадь треугольника по формуле Герона равна " << area << "\n";
```
3. Проверка треугольника на равнобердренность
```
// проверка на равнобедренность
if ((a == b) || (a == c) || (b == c))
    cout << "\nТреугольник равнобедренный!";
else
    cout << "\nТреугольник неравнобедренный!";
```
Очевидно, что необходимо проверить введеные пользователем значения, действительно ли может существовать треугольник с такими сторонами. Для этого применим неравенство треугольника и реализуем его:
```
if ((a + b > c) && (a + c > b) && (b + c > a)) { // проверим, действительно ли введенные значения являются длинами сторон треугольника
...
}
else {
    cout << "\nТреугольник не существует!";
}
```

